[{"name": "Armani", "uri": "https://www.fragrantica.com/perfume/Giorgio-Armani/Armani-827.html", "img": "https://fimgs.net/mdimg/perfume/m.827.jpg", "id": "827", "year": "1982", "gender": "for women", "profile": {"list_of_mainAccords": ["woody", "aromatic", "balsamic", "green", "floral"], "mainpicture": "https://fimgs.net/mdimg/perfume/375x500.827.jpg", "Longevity": ["poor", "1", "weak", "3", "moderate", "9", "long lasting", "22", "very long lasting", "20"], "Sillage": ["soft", "2", "moderate", "14", "heavy", "34", "enormous", "17"], "Reviews": [{"username": "nhledger", "comment": "Armani initially presents as a strong woody/leathery/smokey kind of scent on me, very dry, very classy.  It reminds me mostly of original Fendi at this point - so fashionably 80's Italian, almost condescendingly stylish it's so good. \nGradually the smokiness recedes a little as it sweetens slightly, and it evolves from the initial woody, leathery dryness to the dry green crispness of galbanum. The resin and amber add warmth and the sandalwood a subtle spiciness. After 1.5 hrs it has mellowed and seems to have become a more easy wearing fragrance, although it is by no means less sexy. \nArmani smacks of luxury and quality. And while the Armani name certainly conjures that sensibility, this is not about a name or brand. This is down to the genius composition of this gorgeous fragrance.  Armani is the kind of fragrance I expect would be worn with ease by a beautiful Italian signorina, her long dark hair sashaying behind her. Just simple effortless chic. There's nothing every day or done to death about this scent. It's absolutely magnificent. Sadly, it seems it is another beautiful fatality of a bygone era. Now, I look hopefully to the new kids on the block, the niche perfumers, to take me back to the good old days and stunning fragrances like Armani, and breathe life into them once more.\n Jun 20 2019"}, {"username": "Jay67", "comment": "As a more ‘mature’ guy, this is without a doubt & hands down...... the sexiest women’s fragrance I have EVER had the pleasure of smelling!!! In tandem with my review of the original Armani Eau pour Homme, this fragrance holds a very special place in my heart and I honestly consider it a work of true genius and beauty. I was very lucky to be able to buy sealed late 1980’s EDP & EDT vintage bottles a couple of years ago and couldn’t resist opening the EDT: my brain flashed back and honestly, I immediately went weak at the knees!!\nFrom my very first sniff in the South of France in the mid-80’s, it’s what I still consider to be classy, classic, sexy and sensual. Times and fashions in fragrance may have drastically changed and many may disagree but in this one man’s very humble opinion, I think this stunning beauty deserves to be mentioned in the same breath as Chanel No.5.\nAlthough I didn’t & still don’t agree with its discontinuation, I can kind of understand why it’s no longer in production (ingredient bans and IFRA rules aside) because times and tastes move on but ultimately, a Picasso is still a Picasso, no matter how old it is! A true work of art!!\n Jun 08 2019"}, {"username": "FairyDuff", "comment": "Just applied my first dab from a vintage miniature that I purchased at auction.\nHeavenly, classy, 80's and B-I-I-I-I-G\nPOW! Now that's a perfume.\nI thought I would find lavender high on the list of notes when I looked at this page, but instead I realise I am getting my first experience of marigold in a fragrance.\nAnd I love it!\n Jun 01 2019"}, {"username": "Mona Lygre", "comment": "When X-rays for detecting the smell center in brains come, it will show that my brain will looks like a dogs nose, as a golden retriever, not pugs!\nI miss my beloved dogs nearly as much as I'm missing my Armani...\nI'm always looking for a replica for my Armani, I have written about it before, but, now I'm getting closer to another copy:\nMixing Courreges in Blue edp with Nudo Amber Pomellato - and voila - there it is :))\n Apr 25 2019"}, {"username": "RayIna", "comment": "For ladies with attitude, my neighbor used to wear this one (while it was in profuction. Very potent scent, very complex, not for everyone and not for every outfit. It is class for itself.\nOakmoss here is dominant, like everywhere dense and little bit cold, but here we also have some bitter-cold flowers, with lots of aldehydes, as sum we get one really specific ,,cold'' imoression.\nNot in production anymore with reason, this type of scent is not for mass-production and mass-use, it is too much unique.\n Nov 06 2018"}, {"username": "Mona Lygre", "comment": "An UPDATE:\nBack in 1983 I bought Armani Giorgio for Her at the airplane on the way to my new job as an au-pair-girl in England. -I loved my new perfume, and bought another bottle later on.\nMuch later, it was no where to be found in Norway, and I have been hunting high and low to fill the gap my beloved Armani left behind..\nYesterday I sniffed at Ivoire of Pierre Balman for the 1st time, and to my surprise it smelled nearly the same as Armani :))\nThere is a lot of similarities between the two of them:\n-They both have a huge buckett of GALBANUM in it's recept, \n-they are both very powdery and soapy, just what I like, they are both woody, green and balsamic,\n-and I can smell the cedar, the rose and the sjasmin in the background.\nAnd of cause a bottle of Ivoire came home with me today!\nI can highly recommend Ivoire as a replacement for Armani for Her :D\n Aug 30 2018"}, {"username": "mary ko", "comment": "I feel very lucky I found this masterpiece.I have an extra bottle if anyone is intrested in.\n Feb 08 2018"}, {"username": "Mona Lygre", "comment": "Yes: \"Dear mr. Armani, bring this back!\" \n-I worn this wonderful perfume a lot, and I miss it so very much!\n Dec 15 2017"}, {"username": "Julia-Gayle", "comment": "My first Armani and for me, still his signature scent. Warm, sensual and very sophisticated without screaming it to the population. I wish they still made this.\n Jul 26 2017"}, {"username": "diego.lesgart", "comment": "Is in some country or some stores nowadays any bottle???\n May 28 2017"}, {"username": "purecaramel", "comment": "This is for the EDT 1992-1995 Vintage.\nTypical Cosmair superb blending.\nIngredient rich, smooth Feminine Chypre.\nIt has the Classic,Cool,Casual elegance of an Armani suit. The feel is silkier than that of Armani Eau Pour Homme, but follows the same path of finesse.\nMild Aldehydic opening with a whisper orange and a touch of Spearmint/Galbanum to cool, reminds me of Hermes Orange Vert Concentre for a moment. A floral bouquet with light indoles has non-cloy, as Bergamot weaves into the fabric of the exceptional Oakmoss/Sandal billow. Drydown is similar to Givenchy lll and closer to the sweetness of Jubilation 25.\n Dare say the Parfum was all Feminine. Mixed with the skin scent of a woman would have me ravenous.\n The EDT is Unisex enough for those of us who know and are comfortably Masculine.\n Lovely stuff and recommended!\n May 20 2017"}, {"username": "Dezember", "comment": "Dear mr. Armani, bring this back!\nIt was maybe 1985 when I bumped into this beauty and couldn't leave the department store without purchasing a bottle, although it was quite expensive back then when I was still studying.\nThis perfume you may call rich in any level. I think the best perfumes were made ages ago and it can be seen by looking at the notes listed, usually wide range of different kind of notes which create an amazing symphony together. \nLasting power of this georgeous scent was enormous. It was there next morning, stayed in your clothes without fading away or turning bad. Wish I had a time machine to buy couple of bottles to my retirement fund.\nSometimes I wonder why the houses don't bring back some of the hit perfumes of e.g. 80's? Don't they have the recipes available anymore? These kind of classics would sell out sooner they can even dream.\n May 12 2017"}, {"username": "Walking Unicorn", "comment": "I bought a mostly used bottle from an estate sale last month and finally got around to trying it.  I smell powdery, sweet florals.  There is marigold, narcissus, oakmoss, galbanum, and pineapple.  This definitely smells like the 80's.  Its a stunning, bold, sophicated beauty.  I'm so glad I was able to get this bottle, too bad there is only about an 1/8 of the bottle left..\n Apr 01 2017"}, {"username": "gatsby", "comment": "Would be good to know that the creator of this masterpiece is  \nRon Winnegard  (also the father of Furyo, Rumba Balenciaga or Lagerfeld Classic). This is the first fragrance from Armani brand.\n Jan 10 2017"}, {"username": "icecube", "comment": "I have the pure perfume (vintage). \nIt is surely very, very green and bitter in the opening. \nA bit overwelming as I was not prepared for it even if I understand looking at the dominant notes that galbanum mixed with oakmoss gives a chypre powerpunch. \nVery shyly the flowers blends in and soften the hardest green edges. As time goes by more notes appears but now it is complex and wellblendet.\nHard not to sniff the wrist - it is surely intoxicating and a very wellcrafted perfume.\nWell I must say this is the first perfume I feel I would not pull of wearing.\nThe person I imagine wearing this is a mix of Greta Garbo and Paloma Picasso.\nI imagine her in a chignon and a perfectly fitted wool suit. She walks with a strong posture and her profile is both distinct and beautiful.\nAnd she smells wonderful of Armani's masterpiece.\n Jan 01 2016"}, {"username": "Gigi The Fashionista", "comment": "Fragrance Review For Armani\nGiorgio Armani\nTop Notes\nAldehydes Pineapple Mint Galbanum Marigold Bergamot\nMiddle Notes\nCyclamen Tuberose Orchid Orris Root Jasmine Rose Lily of the Valley Narcissus \nBase Notes\nSandalwood Tonka Amber Musk Benzoin Oak Moss Cedar \nThe First Armani Fragrance\nCasts a spell when you have worn it and experienced it in it's entirety like watching a classic film in black and white, an Italian foreign film starring Sophia Loren. This is a perfume of such sublime potency that it's a tragedy to the perfume industry to have discontinued it or to reformulate it. \nThe fragrance sold through the 1980's as the Armani label became a bigger name in the fashion industry. Armani suits were the must-have designer suits. Just like an expensive and well tailored suit, this scent is elaborate and each note a stich and patch in the outfit of glamorous and beautiful material. It does smell like a classic Italian fragrance. It has a unisex and womanly aura all at once: \nThe top notes are sweet fruit which tickle the nose with pineapple and bergamot, and swimming in aldehydes, lots of aldehydes. The aldehydic content is retro and brilliant like champagne bubbles. It also a bit like glossy hair gel. Deep galbanum emerges to provide the fragrance with it's nocturnal air and evening cologne air. It's luxurious and most definitely a chypre. \nThe florals come and go and they include: tuberose, jasmine, rose, narcissus, and lily of the valley. For the most part it is a white floral aroma. The white flowers of jasmine and narcissus not to mention those lilies are prominent. The white floral texture is soapy and clean. They are not too heady and they are softened after the blast of aldehydes. \nFlorals gone, the scent develops into it's true chypre persona. The galbanum is still there but now it mingles with moss, musk, and woods. The dry down is the true spirit of this perfume. It smells like the night. Like walking around barefoot in a garden. It has flowers in the distance and green aromatic herbs and woods in your nose. The woodsy dry down is to die for! The woods and moss become warmer deeper darker and more mysterious. Out of somewhere there's an incense. \nThis smells a bit like the colognes and perfumes that were deep and dark Orientals at the time: Paco Rabane's La Nuit, Ivoire de Balmain, and Coco Eau de Parfum. This is a fragrance of maturity, complexity, and refinement. It matches up with a black evening gown or midnight blue gown, very grown-up, very glamorous and opulent. It smells like a million bucks and truly honors the label that is Armani. \nI am wearing it now for Milan Fashion Week and I couldn't be happier.\n Sep 22 2016"}, {"username": "Inhershoes", "comment": "I only have a tiny bit left in a miniature, but I can smell how complex and fresh the chypre it is. Smells a lot more modern and subtle than you would expect from a fashion house scent from the early eighties. Absolutely worth giving a try if you can track it down!\n Aug 19 2016"}, {"username": "celticelle", "comment": "This is so well blended, but the note of the marigolds does really stand out for me and makes me love this perfume.  I was able to nab some of this while it's still out there.  A chypre that's not too tart or soapy with galbanum.  It has just the right mixture of galbanum and oak moss and sweet florals to make it enjoyable for everyone, not just diehard chypreheads.  \nThe IFRA should be shut down for making beautiful perfumes like this impossible anymore.  It's just a little oak moss, not some nuclear reactive waste, for heaven's sakes.  This was a particularly elegant and well done chypre.  I class it with the unreformulated Dior Dioressence for refinement in that perfume category.  It makes you dream of classy dinner parties and beautiful clothes and moonlit views out of expensive hotel rooms. Even if you don't have those, you feel like you're there in your head, starring in the main role. There's an '80's sweetness that avoids the \"[email protected]!*h on wheels\" feel of old Chanel No. 19.  Too lovely.\n Aug 05 2016"}, {"username": "Sanskilainen", "comment": "There is nothing more that I can express except for my most deepest gratitude to this perfume. I am so grateful to have been able to get my hands on a bottle of this as there is no more beautiful green flowery galbanum fume than this one. If you ever get a chance on this do take it. It is a masterpiece. Truly. Refined and magical.\nedit::: I 've promised not to buy anymore back ups on anything but I just had to on this one as it is getting really hard to find. Grab it if you can!\n Jul 13 2016"}, {"username": "piahellgren", "comment": "This is the David Bowie of perfumes! Deeply sexy, mysterious, playful, cold and warm, light and dark. Shining almost too green and woody when opening and after two hours (yes, the dry down takes time here or it wouldn´t be called dry-down) it starts to sweeten with all those florals. I have already written a review, but I am happy to say that this absolute beauty is tingling my soul: sweet tuberos, but mild, mint, carnation, excellent vetiver and moss and the most classy pineapple ever. And so much more. Do or die, really!\n May 27 2016"}, {"username": "SuzanneS", "comment": "I picked up a bottle from an estate seller and it was in good condition. It had been sleeping for 30 years. Oh the green opening! The pineapple.. the complex mix of the opening shakes you up on her ride. This is elegance from a long time ago.\nWhen you smell something like this --you revere it.\nAfter a long opening (the quality!!) the heart opens into the most beautiful, elegant heart of a perfume I have ever smelled. So blended, so floral beautiful of unique notes... then the drydown with the cedar and oakmoss..keeping it tinged chypre green on the edges.\nSo fortunate to have come across this in the EDT vintage version. IMO it puts the chanel 19, the ivoire de balmains clearly in second position. Its so complex. Personally, I dont see it close to vintage cartier panthere at all...Best Chypre of all time.\n Mar 17 2016"}, {"username": "Marco<3", "comment": "Iconico, ammaliante, maestoso. \nIl primo Armani. Unico.\n<3\n Feb 04 2016"}, {"username": "diego.lesgart", "comment": "Icon from 80s ... What can I say or add ... I don t know how this masterpiece are missed ... Why not come to nowadays as Armani por homme ??? I wear this great one, I bought this last bottle in 1999, got it yet,  and I only wear in winter ... It is as a precious posime ... Smell unisex may be,  similar or in the La Nuit by Paco Rabanne and Van Cleff pour homme style ...\n Jan 17 2016"}, {"username": "tymanski", "comment": "one of the absolute great floral chypres of alltime in my book. the complexity and deep darkness make this endlessly mysterious. it borderlines on 'powerhouse' but is so refined and timeless. the edt is an anytime wear but the parfum is special. masterpiece and a sad reminder of armani's frag potential\n Nov 18 2015"}, {"username": "ZiZu", "comment": "This was my first ever perfume, one I would share with my sister. My dad always loved perfumes so every year that a business associate of his would travel from Italy for a fair, he would bring a perfume to him. When I was about 14-15 my father asked that associate to bring him a women's perfume for me and my sister; you guessed it, it was Armani. I remember I was so excited to open that black box and I was mesmerised by the scent. For me and my sister it was an expensive potion that we would use with caution so that we wouldn't run out of soon enough. All I can remember is that it was so beautiful, feminine, floral and earthy. I believe that I would recognise it if I accidentally smelled it.\n Sep 11 2015"}, {"username": "Tam", "comment": "I have jut succumbed and brought an EDP of this on ebay. I had a little sample bottle from years gone back which leaked much to my dismay.  I can't wait to get this again. It is at once sweet and sour in a good way, fruity and woody, dense and light. They just don't don't make them like this any more. Overall it is - for me - the smell of confidence with a hint of foxy thrown in. I wore this as 17 year old and remember getting sacked. In the process of 'letting me go' my soon to be former boss broke her conversation to say 'What perfume are you wearing? It's fantastic.' This was the first time I'd been complimented on a perfume and I was so chuffed about this I forgot about getting the boot from my job. So this reminds me of my first sacking but in a very fond way...\nHowever, I recommend going subtle on application. I caould drown myself in this quite happily but it packs a punch. If you like L'Arte, Poison, Paloma, Jacoma etc this is worth trying to get your mitts on.  PLEASE Armani bring it back - in its original formula.\n Jul 22 2015"}, {"username": "fuggerone", "comment": "this is the smell of a beautiful summer holiday I spent in Kent in 1989, it was a present for the girl who hosted me, she wore it all the evenings we spent together out.....\nsome years later...\nlost in my thoughts on a bus in 1998 a girl passed me by while memories of that Kent summer flooded my mind, after a few seconds I realized she wore that scent..wonderful green wood\n Jul 12 2015"}, {"username": "nikoleta1", "comment": "Pleasant classic chypre. Little sour drydown. Average longevity and silage. Impossible to find.\nI got this and Cartier panther vintage and Fend original side by side. All are pleasant, similar in style of being floral oriental /chypre classic perfumes. Fendi is my favorite of all three.\n Apr 23 2015"}, {"username": "thewitcheshouse", "comment": "It was 1982, I was fifteen years old, still at school but had just acquired a Saturday job in Boots the chemist.  It was back in the days of the awful blue pinafore dress uniform with co-ordinated floral blouses.  Boots put me on the cosmetics counter and I distinctly remember that the two cosmetics rep ladies, one from Helena Rubenstein and one from No 7, didn't have to wear the awful uniforms.  Both would parade up and down, made up to the nines, and I am sure in their own minds thought that they were supermodels!  I thought they both looked a bit 'Ronald MacDonald.!  Anyway, on the Helena Rubenstein counter I noticed some really interesting black shiny boxes with gold writing 'Armani'.  Even the dark mysterious packaging drew me in!  The counter displayed tester bottles and as soon as I smelt this wonderful fragrance, I was hooked.  I had smelt nothing like it before, or since.  Every Saturday as soon as I got to work I would smother myself in this wonderful fragrance – much to the disdain of the heavily made-up Helena Rubenstein rep.  I was earning a pittance but never-the-less would spend my Saturday pay on buying either 50ml or 100ml bottles of this perfume.  I have read detailed descriptions of this perfume on this site and I must say, I marvel at the way people seem to be so accurate in their descriptions..........I don't know know what all the ingredients like tuberose or aldehydes etc smell like, but I do know what I like, and this fragrance was a complete one off!  To me, it is dark, mysterious, dynamic, powerful, complex, sexy, dramatic and magical!  It is multi-layered, very sensual, musky but also refined.  There is something 'witchy' about this wonderful potion!  It is spell binding.  Nothing else on the market smells like it.  I have seen comparisons to Magie Noire by lancome, my mum used to wear this, but to me, MN smells less refined and more spicy and gingery that Armani.  Armani is subtle and yet at the same time arresting.  It lasts absolutely ages and is totally unique.  I wore this fragrance all through university and I was totally mortified when I learnt that it was to be discontinued.  As a student I didn't have much money then and the thought of stocking up before it disappeared forever was beyond my means.  I purchased Armani's follow up perfumes diligently, Gio, Aqua de Gio, Mania etc etc but none of them were a patch on the original, classic, Armani.  Why oh why did they discontinue this wonderful fragrance?  However, I have to say, that I am also rather smug that it has become so rare.  A couple of years ago when I was feeling a bit flush with a new O% on purchases credit card, I found a stockist on ebay and I  totally cleared him out!  £1200 worth of boxes of Armani fragrance!  I have enough to fill a shoe box – and a couple more besides.  I am now 47 and confident that this beautiful fragrance will now 'see me out'.  I did write to Armani a few years ago to enquire whether they would bring this perfume back, but alas, they have no intentions of reintroducing it.  I suppose that is just as well as I have stockpiled about 1500ml of it!  I keep them in their original packaging, in a shoe box, out of light, and guard it like an elixir!  To all of you out there who lament its loss, be assured, you can still acquire it, but it is getting more and more expensive and harder to find.  It is a very indulgent purchase in these days of austerity but as perfumes go, Armani was my first love, and you never forget your first love do you?\n Apr 12 2015"}, {"username": "susiebashse.", "comment": "Oh how strange and wonderful..... Got an eBay treasure...100 mls of vintage edt. Wasn't sure if I liked it at first but now I am quite mesmerised... Just lovely ...deep green wood...drama and comfort all at once.\nWhy are modern scents so poor?!\n Mar 06 2015"}, {"username": "juzme", "comment": "Have both Armani and Cardin and if I was to choose which one I liked better , it would be Cardin , but Armani has also a place of honor ,as a brother of Cardin . Same family , same love.\n Nov 30 2014"}, {"username": "dempsterstreet", "comment": "Armani is a tagetes-chypre-floral foghorn, with one arched eyebrow and one perfectly-manicured hand on the wheel of her Ferrari: loud, proud and fabulous to know. \nIn the crook of my elbow, I swear it lasted for days.... \nI love this perfume, it's sexy and elegant, grown-up and confident. It was my signature when I had such a thing and I am sadly regretting all the times I didn't buy extra bottles in the nineties when it was readily available. Although who knows if those bottles would smell as good as now!\nSIGH!\nMy remaining supply (a vintage mini) is in a steel underground vault only accessible by a scan of my retina. \nWell, it's actually in my jewellery box. But still.\n Nov 17 2014"}, {"username": "David Mellard", "comment": "Hi there. this fragrance was one of the thirst ladies perfume I ever wore back in the early to middle (80ts) as a friend who was also male wore it as his Signature fragrance and I just had to purchase a bottle of the eau de perfume I studied catering but it was this iconic Armani scent that inspired me to go on to work within the fragrance sector. I didn't know much about fragrance at the time but having worked in the industry since (1998) but more theses days with the more High End Niche and Bespoke perfumery knowing what I know now I think that the thirst fashion house of Armani's first perfume launch is the classics fragrance of the channel and the Guerlains of that era I would like to have a bottle of this chypre perfume but it is extremely hard and rare to find. it was recently Relaunched as a one off Limited edition exclusively to Harrods by the perfumery and cosmetic company Coty or Unilever. it was made as a one off in a special perfume decanter made by Baccarat or Lalique I think and it is worth over a thousand and a half pounds. the fragrance is such a distinctive smell nothing else comes close to the real thing as un like the famous Claude Montana fragrance for women with the twisted bottle. I did see someone else's comment on the same page and how they said that it was old fashioned. but vintage is in at the moment and a lot of these old perfume fashion houses are beginning to realise that people are requesting for the classics as the fragrances of theses days. not all of them mind u smell just like one another and that there has not been much effort that has gone into creating it. a lot of them are chemically enhanced and more about the advertising then what actually goes into it. from my experience in working in the industry in some cases feed back gets back to the perfumery companies as customers usually request for a particular fragrance witch is no longer in production sometimes they may Relaunch based upon the over whelming request for that fragrance. but so far I have not heard that they may produce it but I think they should as it is well overdue.\n Nov 04 2014"}, {"username": "Beaufort", "comment": "If you love this fragrance then you should definitely try Jacomo Rare/ Coeur. Jacomo Rare/Coeur is also, like Armani discontinued, but you can still find it on the net. I find these two perfumes almost identical.\n Oct 12 2014"}, {"username": "Dinkum", "comment": "Some time ago I fell head over heels for Oriza Le Grands Chypre Mousse. It´s minty opening reminds me of this vintage Armani. Different in drydown, though.\nArmani is a beautiful scent but feels somewhat dated, IMO. Chypre Mousse is similar in many ways, but with a more modern feel to it. If you yearn for the classic Armani, but can´t get it, or want a more modern alternative Oriza Le Grands Chypre Mousse might be something for you...?\n Jun 05 2014"}, {"username": "sherapop", "comment": "This 1982 creation from Giorgio Armani definitely smells like it came from the 1980s: brazenly \"old lady\"--or people might say today, this is a no-holds-barred rather intense and dense creation. A classic combination of aldehydes and dark oakmoss and possible animalia along with big, bold flowers such as marigold and narcissus combine to create a perfume which honestly will smell dated to younger perfumistas now that the age of SSRI fragrances is well and truly upon us. \nThere is a good deal of big florality here and also a kind of richness which is no longer considered appropriate--if we are to judge by what has happened with marketing-based trends toward simplicity and cleanliness in more recent fragrance launches. Just look at the awe-inspiring note list!\nI am grateful to Action for having sent me a well-preserved mini of this, the very first Giorgio Armani perfume!\n Mar 30 2014"}, {"username": "m_mtz40", "comment": "Precious precious scent! In the words of Carrie Bradshaw: \"Real love!! Ridiculous, inconvenient, consuming, can't-live-without-each-other love!!!\"   ~ AMEN!!!  \nBut I just found a very similar one in L'ARTE di GUCCI! It shares most of the same notes n is long lasting as well!  I agree w Mals86 that \"L'arte has a smolder, a smoky-eyed stare, that one rarely sees outside film noir.\nAlso good are Eau de Gucci & 19 Channel (both hard to find & also discontinued), Salvador Dali (very close & the best modern equal)  and Leonard de Leonard (close but not as lasting).  I will have to try Climate Lancome, Y YSL, Potion DSquared & Passion Annick n get back to u... But Weil de Weil does not work on me at all..  I agree w Maeculpa that Champagne (now named  Yvresse) is good but not the same.. yes true that!\n Feb 23 2014"}, {"username": "aber19", "comment": "I have stocked up on this perfume. The quality is supreme. It has not gone off for me. It smells perfect. But you need to store this perfume in a dark and cool cupboard. Do not put it on in heavy light, or place near very hot areas.\nIt can effect the perfume. I depends how the perfume has been stored in the first place. I tend to stand it upright, make sure the cap is firmly placed on it. Air is problematic to perfumes.  While I do not have my Armani in the box, it found an alternative perfume box to place it in.\nIf the perfume is slightly off, you will realise that the top notes will go off, smell terrible: but the other stages may remain in tack. For example for my vintage Sublime from Jean Patou, the top notes smell like off musk with an alcohol stench which is not pleasant, so the strength of the perfume remains compromised. \nIt may be worth asking the seller, how the perfume has been stored, and if the perfume has only remained with them. \nI do not wear the Armani perfume often and but will wear it early in the morning. Remember a little goes a long way. \nIf you look at Ebay, you may find it. I have seen this in bidding auctions, where some people do not even know that this perfume is a rare treasure. When, I bought my Armani, and the seller was not sure if the perfume was for men or women.  So it does come along occasionally whereby the perfume is sold at a steal. So you will need to check relevant perfume sites dealing with vintage fragrances. Yes, vintage perfumes may change over time, this is the chance you may need to take.\n Dec 10 2013"}, {"username": "teebee", "comment": "Armani was my first perfume. It was a Christmas present from my parents. I love it and have just found out it is discontinued. I'm devastated! it's only a perfume but to think I will not be able to smell that scent again is unbelievable. I was just telling a friend last week how much I lived this perfume. I used to wear it going out clubbing in the 80's and early 90's. I wish I still had a bottle. I felt very sophisticated and edgy in a confident way when I wore it. Is it worth trying to find a vintage bottle of Armani? Would it still be ok to wear?\n Dec 05 2013"}, {"username": "nikkibom", "comment": "Been crying for this one for so long - then .... While being nosey in my Stepmum's bathroom - rummiging through a minature perfume collection in a large seashell on display - i found 2  5ml minatures of Armani - from the 80s!! I informed her that I would be taking them home with me - hehehehe!!\n Oct 02 2013"}, {"username": "lsh55", "comment": "I bought it back in 1983 after I got a sample, which I loved.\nBut I found out it made me sneeze. After having used it for a while it changed on me, it became a scent different from the one I fell in love with and I began to dislike it. The sneezing may be one of the reasons I fell out of love with it.\n Sep 21 2013"}, {"username": "LadyKath", "comment": "To me this is THE PERFUME!!\nThe loveliest, the One I can't do without!\nI was charmed at first \"sniff\" in the early '80s and have been a delighted prisoner ever since.\nI have certainly stocked up on it, since I'm really afraid to be without it. \nAs many fragrances as I love, this is the one that I always think about as my all time favourite.\nNot only a scent of Paradise, but also a piece of Heaven here on Earth. It takes me to another world - an enchanted one - and it lasts (even on my clothes) forever - always to make me feel excited and special.\nGorgeous - but sometimes a bit too much to wear on an ordinary day.\nYou only need just a little, because it casts its spell on everybody in a room (and sometimes even those in the next room) and you can't expect to be invisible wearing it.\nThis scent is a true masterpiece!! I love it so much!\n Sep 12 2013"}, {"username": "diego.lesgart", "comment": "ARMANI POUR HOMME WAS REFORMULED IN 2013, WHY ARMANI POUR FEMME NOT COMING BACK???!!!\n Sep 08 2013"}, {"username": "[email protected]", "comment": "is this really discontinued? could someone please let me know if they found it and where? thank you!!\n May 18 2013"}, {"username": "Infatuation", "comment": "Armani original was the epitome of Giorgio's true vision as a designer.Bold, elegant,feminine yet strong.\nIts unfortunate to see the direction the \"Brand\" has taken with extreme commercialisation.Sugar sweet stinkers and starlets like Megan Fox fronting the franchise.Enough said.This one of my favourite Chypres(I am always hunting for backups)Mysterious,Authorative,Carnal and Sensual.\nA genuine Armani creation.\n Apr 22 2013"}, {"username": "[email protected]", "comment": "this was so very great!! i have a feeling it must be discontinued..why and how and how and why! so disappointing..\n Apr 21 2013"}, {"username": "maeculpa", "comment": "You utter beauty. Where have you gone? Why have you deserted me?\nI fell in love with this in my late teens and early twenties. It was so easy to get and at the time I did not need anything else. And then they discontinued it! Why on earth? \nLaunched me on a quest to find something that made me feel rounded and sensual in the same way, which led to a frightening parade of lesser scents and an obsession with testing every new thing out there.\nI'm an Armani girl for life now. Don't know if that is a blessing or a curse. Emptied quite a few of his bottles and have some on my wish list. His stuff is modern but also accessible and lasting with no grande dame perfumyness and not many gourmandises. \nI tried Annick Goutal passion based on the review below and i do not get the same mellow wholeness - it starts way too loud and then like all the AG fragrances I've tried it is a blink and you miss it experience. I have some drops of Champagne (the original) by YSL left and it is lovely but not the same. Nothing is the same. Sob. \nNote to self try Y.\nLike the memories of a first love I can't remember the smell of this at all, just that it made me feel gorgeous like nothing else. Suggestions welcome!\n Apr 10 2013"}, {"username": "piahellgren", "comment": "This is the best fragrance ever created. VERY classy and never boring, extremely individualistic without being the slightest bit off-putting. There is/was NOTHING like it! Intense, warm, chilly, minty, animalic, salty, lush, almost sexual, but without ANY overly cloying oriental sides to it.. A fierce yet comforting scent. Strangely natural even though there are so many components in it. A gem, a masterpiece. All these contradictory words make a completeness that smells so wonderful- particularly in the dry-down- that I could get a rush just out of sniffing myself when wearing it. Nothing will ever smell so much like me.\n Mar 28 2013"}, {"username": "mysticgoose", "comment": "I like this quite a bit. I tried it based upon the comments I found here. I do consider it a unisex fragrance that is green and easy to wear. Easier than Chanel 19 but I love them both. Another chypre that is similar and now only available EDT is Y by YSL. It is worth a try. I have gotten the perfume on line. Y is the only scent my Dad got my Mom and she still has some. If you like Chypres Armani and Y are splendid.\n Mar 08 2013"}, {"username": "fanny", "comment": "I do not think at all this is like Passion de Annick Goutal, like some of the previous reviewers do.\nWhat is called masculine in Armani -by Elisabeth M- I call character. \nPassion is a nice office scent, Armani is a mind-blowing breeze from northern Italy.\nLe Climat de Lancôme could be a substitute, but it is more sweet.\nI am with Action and Cisco.\nCold can be good.\nCold also means fiery and flying high.\nAlways, I am on the look out for more of this Ice Queen.\n Feb 14 2013"}, {"username": "Elisabeth M.", "comment": "If you like Armani for Women which is discontinued for quite a while now and you are looking for a substitute try 'Passion' by Annick Goutal. Passion is less masculine but has the same green oriental opening as Armani for Women and is also definitely an 80's perfume.\n Oct 04 2012"}, {"username": "hermyonee", "comment": "oh, this one used to be my mom's fragrance for years whe I was a kid; for me it's just her... she used it almost since I was born, in 81, and she was soo sad when it was discontinued. Such a pitty! I remember it was quite sharp, fresh, a bit fruity, classy, a nice chypré, elegant, it was really perfect for her, so lady-like.\n Sep 27 2012"}, {"username": "Fimafeng", "comment": "My first regular girlfriend wore this scent in the eighties. She wore a lot of other perfumes too, all of which I have forgotten. It is this very one that reminds me of her. I guess that is a sign of excellence.\nIt really has a double character and the age span is wide, about 17-55. \nIt is light but personal. It is sexy and loveable. It is fresh but intense. It is for blondes as well as for brunettes. It is for laughs and seriosity. It is cool and warm. It is for business and pleasure. It is for days or nights. It goes with denim or silk. It could be worn for any season. It has depth and shallow tones. But it always takes you to the top and embraces you.\nSometimes I wonder if this fragrance is the most versatile ever constructed.\nIt is indeed a very very fine fragrance.\nIt is a scent of excellence.\n Sep 25 2012"}, {"username": "dromidreza", "comment": "i think its unisex.why???\n Aug 21 2012"}, {"username": "tsgibbns", "comment": "This was my all time favourite in the 80s and the only fragrance at that time suited my body chemistry.  Sadly, Chypres are no longer available and I find it very difficult to find a (new) fragrance.   Where can I find it?\n Aug 08 2012"}, {"username": "kuanyin4", "comment": "I scored a beautiful NOS bottle, because if it is discontinued, I have to hunt it down, right? My first little test, I was not a fan. Surprisingly not. But I decided to give it full go today and it grew on me. It is different, and I could see falling in love with it. But, it disappeared from my skin in a rather short amount of time. I didn't think about spraying my clothes, I should do that more. My skin is like the perfume monster munching up lovely fragrances. So, I am still rather undecided about keeping it. What to do, what to do....\n Jul 26 2012"}, {"username": "AveParfum", "comment": "Sadly I have a rancid sample, but the marigold, galbanum, and oakmoss are still highly and immediately detectable.  This perfume seems very 80's, but I can tell it's a quality 80's perfume!  As the notes imply, this perfume is very orange--like deep yellow enhanced with gold.  I KNOW there is something beautiful underneath the rancid yucky stuff.  I bet this was the signature of countless women in its day!\n Jul 13 2012"}, {"username": "Toyota", "comment": "Very good perfume but it kinda repels me. I might like it on other people but its not for me.\n Jul 13 2012"}, {"username": "amariah", "comment": "This perfume is my all time favourite, its longevity is remarkable. I think of sexuality, class and mystery. The product is exceptional.  I have placed on my clothes and it lasts for days.I have stocked up on this fragrance, being an avid respecter of excellence fragrance.  I would have to say, the uniqueness of the fragrance would be impossible to capture, because it is complex, stylish and not a shallow fragrance.  It has multi-dimensional qualities, for ever changing.  It is a purely reassuring scent to make an impression, particularly in a legal setting or job interview as a evening seduction tool.  If you want something a little different from the rest. Then I found this to be my signature scent. The reason being because it has a lingering trial which is exotic. Interestingly, it is classic fragrance which could be worn at any era, a true masterpiece!!!!\n May 09 2012"}, {"username": "diego.lesgart", "comment": "Totalmente de acuerdo con Natalia Lorenzo... una de las mejor fragancia de los 80s hasta hoy,fascinante como una bebida quizas algun brandy o whisky, por asi decirlo ... No se por que dejaron de fabricarla, nunca lo supe... si Armani Pour Home aun esta vigente y es su contemporanea...\n Apr 22 2012"}, {"username": "ward.w.3ood", "comment": "Perfume is very beautiful\n I hope I find\n Mar 02 2012"}, {"username": "passionata20", "comment": "HIGHLY RECOMMENDED! \nThough i am not really into this type of smell, but this one is gorgeous. Yes it is chypre, but apart from many others this is not an offensive chypre, not a heavy one. Opening has bitter note, yet it is warm and not scary (thought about bitter orange but this is soft marigold, yes it is beautiful here). It has very strong vetiyver note, which is quite dominanting, but not overpowering like i have experienced in some other chypres before. Maybe because of all the flower notes that are also in composition? At first you don´t smell them at all, but later when it begins to develope you can smell the floers here as well. At first i was starting to wonder where are all of them hidden and \"voila\" here they are! I can smell bergamot, narcissus, a bit of rose and lilly-of-the-valley and a very unusual and surprising accord of mint, which makes it truly refreshing after a bit harsh opening. The drydown is just a bit soapy without being too strong on vetyver and has a really soft and nice woody note and unexpected mint note. The mint in this fragrance is \"the catch\", if there wouldn´t be it, then it would be just another regular chypre fragrance. Bravo!\nGreat sillage, great lasting power. Really nice. Now i am ready for pure parfum as well. \nThis was a review for EDT.\nIt reminds me a lot of Courreges \"In blue\" in the opening which i have in pure parfum concentration, though Courreges is a softer one and more warm, less chypre to my nose. \"Cardin\" by Cardin has also similarities, though Cardin is even more harsher and stronger with vetyver note and really misses the fabulous minty note. And i agree with Action who wrote that this one is also similar to \"Leonard\" by leonard, though Armani is less flowery to me in the middle and in the drydown..\nUPDATE (5,5 hours later): this one is really beautiful! I guess i begin to start loving it more and more. The longer it stays on my skin the better it is... Can´t say enough good words about this one. Minty-soapy-woody drydown has really got me! My oh my, why didn´t i go for a pure perfume bottle straight??? I really hope the one i was  looking at is still available. HIGHLY RECOMMENDED!!!\nUPDATE (4months later): THIS IS LOVE! UNCONDITIONAL LOVE! I´v e grown to love this fragrance very much, this is my perfect spring time fragrance. I´m stocked up!\n Jan 03 2012"}, {"username": "jacoanna", "comment": "Profumo spettacolare che ha segnato la mia infanzia, mia mamma ne conserva una bottiglia quasi vuota e annusarlo di tanto in tanto mi fa piombare di colpo in quegli anni lussureggianti e dorati, dove tutto sapeva d'estate e di lusso. Estremamente sensuale e femminile, particolare per l'accordo della menta e di note calde e profonde. Lo trovo un po' simile a Magie Noire de Lancome.\n Dec 16 2011"}, {"username": "Henriette", "comment": "I remember this was very unique and truly special. It was somewhat innovative too. The chypre feeling was green but not sporty as one would naturally expect, or masculine. Not at all. It was an extremely feminine fragrance, very elegant, totally in line with the couture of Re Giorgio Armani. It is a pity this has been discontinued, I would really love to buy and enjoy it again. And I am puzzled that all the Armani perfumes that followed are not in the same league of this first masterpice. Not even close.\n Oct 25 2011"}, {"username": "NATALIA LORENZO", "comment": "TODAVÍA ESTOY LLORANDO POR LA DESAPARICIÓN DE LA MEJOR FRAGANCIA FEMENINA DE LOS 80'S.\nPUEDO ENTENDER QUE FUERA DEBIDO A QUE ALGUNO DE SUS COMPONENTES YA NO SE PODÍA UTILIZAR EN SU MOMENTO. BIEN. \nPERO SEÑOR ARMANI: ES NECESARIO ABURRIRNOS CON EL CONSTANTE LANZAMIENTO DE FRAGANCIAS QUE HUELEN TODAS IGUAL, ES DECIR 'A NADA'??????\n Oct 06 2011"}, {"username": "zoetegoed", "comment": "And I love it too!\nI am wearing it now, i have some left although the smell is changing after all these years.\nBut it still is warm, soft, feminine and I wish it was availbale again.\nThose people offering those bottles, that's old stash?\nWhen did they stop the production?\n Jul 12 2011"}, {"username": "Galya", "comment": "I don't like it for some green oily old fashioned note ,but longlasting of this perfume is very notevole !\n Jun 07 2011"}, {"username": "cisco", "comment": "I would give up most of my 100 or so fragrances, to own gallons and gallons of the pricey rare beauty.  It is simply divine.\nWHY OH WHY DID THEY STOP MAKING THIS MAGIC ELIXIR????????\n Jun 07 2011"}, {"username": "Action", "comment": "This one being so hard to get and soo expensive, try some members of the same family: leonard de leonard, weil de weil, lancetti suspense and the also hard to get azzaro original. Love this family!\n May 01 2011"}, {"username": "imoore", "comment": "It is for man girls!\nLook at the notes!\nI have a mini and I swear it is for \ngents rather than ladies.\n Jul 24 2010"}, {"username": "truffles", "comment": "This was gorgeous. Grassy and fresh, I always felt there was an orange-type note in there although it's not listed as far as I can see. I found it especially nice when worn on a cold day, when a crisp waft could be detected when air hit skin. It is obviously remembered by many and highly sought after today with old bottles appearing on the net for £150 and more. Armani, PLEASE BRING IT BAAAAACK!!!!\nUPDATE: I have now emailed Armani with a link to this page to say they should bring this perfume back!\nUPDATE: Thanks so much to Galya who has sent me a mini of this.\nIt is a masterpiece, I love it as much as I did when I was 19 as the 80s turned to the 90s.\nIf anyone chances to buy the £150 sealed bottles apparently available please let me know if they are genuine and in good shape!\n Oct 06 2009"}, {"username": "lombredansleau", "comment": "One of the very first perfumes I bought as a teen and I loved it. Stylish, gorgeous scent, I wish Giorgio Armani would bring it back on the shelf, it was truly a fantastic oriental, modern fragrance.\n Apr 30 2009"}, {"username": "sunloving_gal", "comment": "I still have some left!! The orginal perfume and some eau da Perfume and a very little eau de toilette.  It really is a beautiful perfume.\nSarah\n Jan 04 2009"}, {"username": "Superman9", "comment": "Agree with soirdelune. I just love this perfume.\n Aug 25 2008"}, {"username": "soirdelune", "comment": "This was a gorgeous scent, one of the defining fragrances of the Eighties for me. Could never understand why this gem was discontinued -- it was a beautiful, feminine partner to Armani's original fragrance for men. It also had a loyal following among ladies of my acquaintance. I'd love to smell this again! A stylish scent.\n Jul 30 2008"}], "Usernames": ["nhledger", "Jay67", "FairyDuff", "Mona Lygre", "RayIna", "Mona Lygre", "mary ko", "Mona Lygre", "Julia-Gayle", "diego.lesgart", "purecaramel", "Dezember", "Walking Unicorn", "gatsby", "icecube", "Gigi The Fashionista", "Inhershoes", "celticelle", "Sanskilainen", "piahellgren", "SuzanneS", "Marco<3", "diego.lesgart", "tymanski", "ZiZu", "Tam", "fuggerone", "nikoleta1", "thewitcheshouse", "susiebashse.", "juzme", "dempsterstreet", "David Mellard", "Beaufort", "Dinkum", "sherapop", "m_mtz40", "aber19", "teebee", "nikkibom", "lsh55", "LadyKath", "diego.lesgart", "[email protected]", "Infatuation", "[email protected]", "maeculpa", "piahellgren", "mysticgoose", "fanny", "Elisabeth M.", "hermyonee", "Fimafeng", "dromidreza", "tsgibbns", "kuanyin4", "AveParfum", "Toyota", "amariah", "diego.lesgart", "ward.w.3ood", "passionata20", "jacoanna", "Henriette", "NATALIA LORENZO", "zoetegoed", "Galya", "cisco", "Action", "imoore", "truffles", "lombredansleau", "sunloving_gal", "Superman9", "soirdelune"]}}, {"name": "Giò", "uri": "https://www.fragrantica.com/perfume/Giorgio-Armani/Gi--418.html", "img": "https://fimgs.net/mdimg/perfume/m.418.jpg", "id": "418", "year": "1992", "gender": "for women", "profile": {"list_of_mainAccords": ["white floral", "floral", "woody", "balsamic", "warm spicy", "powdery"], "mainpicture": "https://fimgs.net/mdimg/perfume/375x500.418.jpg", "Longevity": ["poor", "4", "weak", "2", "moderate", "8", "long lasting", "32", "very long lasting", "68"], "Sillage": ["soft", "7", "moderate", "19", "heavy", "55", "enormous", "49"], "Reviews": [{"username": "massimilianoinquieto", "comment": "Un altro profumo da seduzione fatale degli anni 90. \nDenso,cremoso,fiorito di fiori carnosi e ipnotici dove spiccano la gardenia,la tuberosa e i chiodi di garofano.\nRicorda lo stile di Giorgio Beverly Hills e di Roccobarocco,caldi, dorati ,ricchi,sfarzosi.\nL'opulenza di questi fiori cerosi e dall'estrema intensità è una cosa a cui non siamo più abituati ma la bellezza di indossare oggi un profumo come questo è estremamente gratificante.\n Apr 25 2019"}, {"username": "lanolin", "comment": "I wore this perfuma about 95s and i remember ,after days, i would still feel the notes.... This is my number one parfüme still after years, and it will alyays be. Such sophisticates scents make me feel royal and very elegant.\n Jan 30 2019"}, {"username": "SF2", "comment": "I think I was in college when this came out. I loved it. To me, it smelled warm  and smooth. I think it was the amber and spices. I found it sexy, but almost on the verge of unisex, as it was very sultry but not particularly feminine. .\nI believe I had it twice...maybe I bought it once, and maybe it was a gift once...but both times, even though I loved it, I must have needed the money for books or tuition or electricity or something, because I remember returning and/or selling it. I did the same with Chanel Allure. I was so broke, I sold my good stuff and had to make do with Gap Heaven instead. Here it is almost 30 years later and I am still mourning the loss...\n Sep 19 2018"}, {"username": "SuzanneS", "comment": "This is probably one of the largest white oriental floral that ever existed. Its absolutely huge, heavy, rich and spicy. Its luxe and over the top in 2018 but in 1992 it was otherworldly.\nIf you ever dreamed of a full white floral symphonic spicy balsamic fragrance...this is it.\n Aug 23 2018"}, {"username": "sibaraa", "comment": "A very intense woody floral oriental, a little goes a long way, the silage is a monster!\n Apr 13 2018"}, {"username": "Iris-Siberica", "comment": "Used to wear this around 1995/1996 but I was glad once it was finished.  Very sickly/strong perfume. I certainly wouldn't have bought it again if it had been available again.\n Jan 04 2018"}, {"username": "renzi79", "comment": "The year was 2013... there I was, gutted to find Gio was discontinued!\nDesperate, Needy..   And that's when I found Fragrantica- while searching online for GIO!\nLook no further for a replacement than Montale Gold Flowers-- a pricey dupe,\nbut the sammmme. Spicy sandally, smooth and sexy!get your hands on it - its also hard to find, but ebay may have samples. good luck!\n Aug 31 2017"}, {"username": "Contessa01", "comment": "I have wanted this for a long time but could not make my mind up based on the reviews. I loved the thought of the honeyed floral but hesitated at the comments saying it was overwhelmingly tuberose. I decided to cave (big surprise) and buy an expensive second hand bottle online. So my thoughts are firstly that it is not overwhelmingly tuberose at all. I have really gone off tuberose lately unfortunately and sadly as I have a lot of tuberose sitting on my shelf but I just cannot wear my Fracas lately. Anyway, secondly my thought is that while I have only received this today and will update it if it settles differently, I am suprised noone has mentioned I think how much this is like Amirage by Givenchy. In fact, I think if you are really wanting this but struggling money wise in the meantime (or instead since it's a fantastic frangrance) wear Amirage. It is really so so similar. It has that honeyed honeysuckle vibe that Amirage has. I think that I could actually just have Amirage and be ok. So don't despair! I do love it though and if my nose changes next time I try it I will update.\n Jun 22 2017"}, {"username": "chloeh", "comment": "Snowminx - if you love the perfume and it is discontinued, then definitely keep them. :)\n May 15 2017"}, {"username": "chloeh", "comment": "Oh God, an ex ended up buying a bottle of this for me, on a plane, when I was very young.\nI had asked the duty-free stewardess if she had any Giorgio, but they didn't have it and she offered me this, instead.\nProbably due to the similar-sounding name.\nIt was in a nice bottle and I admit I was somewhat lured-in by the Armani brand.\nSo, naively, I let him blind buy a big bottle of it for me.\nI really shouldn't have done, I should have just said \"No, it's OK thank you.\" and saved the poor guy his cash.\nAnyway, it was a total disaster.\nIt reacted horrendously with my body chemistry and I, genuinely, smelled like I had been sprayed by a tomcat.\nThere is really no other way to describe it.\nI'm not exaggerating - people were, literally, recoiling from me!\nTo be fair, it was quite funny, looking back.\nLooking at the notes, now, I can't really imagine what caused it?\nMaybe it was an off-bottle?\nIt's probably a lovely perfume, on those it suits, but on me? \nSadly, no.\nOr not that bottle, anyway.\nGave it away to a friend, in the end and haven't even gone near any Giorgio Armani perfumes ever since!\nThe relationship also turned out to be somewhat of a disaster, unfortunately...\nMaybe it was an omen?\n May 15 2017"}, {"username": "Snowminx", "comment": "I've loved and worn this perfume since it came out in 1992, I've never been able to find a suitable replacement since it was discontinued. Since then I've scoured old perfume shops and eBay and sometimes had expensive fakes (annoying) but today I can't believe my luck. I'm holidaying in a tiny Italian village and right at the back of a dusty shelf behind all the other perfumes I have found 2 x 100ml eau de parfum and 3 x 50ml so I went to buy the lot. The old lady owner was a bit surprised, she doesn't have a computer system but showed me her paper files and when she bought them in the 90's. She then went up to her stock room and produced 7 more 50ml bottles all in the packaging from her supplier.\nQuestion.\nDo I keep a couple for me and sell the rest or just keep it knowing I'll never need to buy perfume ever again?\n May 06 2017"}, {"username": "lmwimsatt", "comment": "I just got this in my mini set and supposedly it's dc. Like a person, a perfume becomes divine once it dies. Gave it to my landlord in exchange for a favor. She loved it\n May 05 2017"}, {"username": "df21", "comment": "My dad gave me a bottle of this once for Christmas. He bought the wrong perfume, the one I wanted was Ácqua di Giò.I was a bit disappointed since I was completely in love with Ácqua but as the perfume addict that I've always been I couldn't resist giving Gió a try. Little did I know... It wasn't love at first sniff and I found it a little bit strong at first, but after an hour or so, it developed into a soft creamy scent that resembled a lot of Ácqua di Gió - only stronger, sweeter and more exquisite. \nI know and have worn many perfumes and although Gió isn't in my absolute favourites Top 10 list, it's probably the scent that blends best with my skin chemistry, out of all of them. I never received as many compliments with a perfume as I did while wearing Gió. I would have bought a second bottle if I realized it would be discontinued so soon. Armani should bring it back!\n Apr 23 2017"}, {"username": "Alvie Kuptz", "comment": "I have 100ml of this perfume. 80% left in it. \nif you want to buy it or swap pls message me. Thanks\n Jan 09 2017"}, {"username": "CaroleWard1812", "comment": "Why has this perfume been discontinued,I love it,I had to order it from America so bought 2 bottles,had to pay custom & excise but it was worth every penny,anyone know where I can buy more.\n Dec 16 2016"}, {"username": "irawidatami", "comment": "bring it back please\n Dec 15 2016"}, {"username": "Orient74", "comment": "Please bring back !!!\n Aug 25 2016"}, {"username": "Mesquite-Bean", "comment": "Can someone lend their opinion?  I'm in love with Honeymania from Body Shop.  Does anyone else besides me think this smells like Gio?\n Jul 01 2016"}, {"username": "Vegas Pauli", "comment": "A medium strength woody/white floral that was in fashion big back in the day (aka Safari, Ysatis, Jil Sander No 4) but the clove in this made it distinctive and somewhat exotic. Too bad its discontinued, Armani needs to bring this one back.\n Jun 29 2016"}, {"username": "twylaleblanc", "comment": "I would be interested if anyone has some of this that they would like to sell. Please email me [email protected] Thank you!\n Jun 29 2016"}, {"username": "juliana chika", "comment": "i really love it too much\n Jun 24 2016"}, {"username": "socorrosouza", "comment": "I loved it, it was immoderate, loud. On me it started as a blast of tangerine and peach, which was somewhat tamed by the tuberose and this tangerine/tuberose peachy combo went on for over 20 hours than starts to morph into to an ambery tuberose . Longevity and sillage were astounding.\n Mar 25 2016"}, {"username": "Ohkit", "comment": "A sophisticated, sensual white floral perfume. Although I am not a huge fan of this olfactory group, I must admit that Gio is less loud than other white florals  and it's even office appropriate. I like the bitter notes in it. Definitely reminds me of Poeme. Beautiful and melancholic.\n Mar 05 2016"}, {"username": "ramskates", "comment": "In the early-mid 90s I worked part time for L'Oreal Cosmetics as a sales rep/merchandiser (best job I ever had btw but I quit to have babies) so one of the benefits was getting to buy any Cosmair products at a discount once or twice a year.  When this one came out I ordered it and loved it because it was so different.  It was strong and almost obnoxious but it fit the times and it made me feel confident.  I still have my original bottle and amazingly it hasn't spoiled.  I don't wear it though because my tastes have shifted to softer scents.  To my nose Juicy Couture Couture is very similar but not quite as rich.\n Feb 17 2016"}, {"username": "la fleur dorée", "comment": "Found an old full bottle. Maybe I oversprayed. Rancid butter, tuberose, carnation, a sinned-against, obscene jasmine. Makes you feel claustrophobic. Throat-grabbing and very dated Eighties smell - padded shoulders and fake jewels. Stubborn too, I tell you.\n Feb 16 2016"}, {"username": "Jernê Knowles", "comment": "Large hard scent to please right away, it should be because you have a vast amount of notes, very common feature in the fragrance of the 90's decade where the perfume creators had not \"worth\" of the composition of his works, metiam balmy notes, shuffled here, put another kilo note there, and the result was an aromatic pump acclaimed by a large majority, and for this reason is super hard to recognize most of the notes, we go on track and realize one here and another there in the midst of a crazy amalgam of aromas. Its opening is floral and burly, with prominent Hyacinths, dried roses and a half aged, Violets with all its power and another jasmine with its characteristic white floral often reveal that touch indole means Sujinho, but nothing intolerable. Hence it will be transformed into an Oriental floral perfumão a little confused with the appearance of such a flower, earth notes and spices, at the same time he is floral, it's earthy, it is herbaceous, is clean, it's spicy, it's cold, is hot, it's close and finally engaging. In his order, which by the way takes a bit to appear, he gets an oily resin-is the Mirra here that reminds of Orthodox Churches anointing oils that when we got to the front door feel it coming in the receive, this aroma is between one burned Cedar and inedible sweet vanilla, it still gross, serious and admirable; you can tell a light musk there on the precipice holding Gio skin until after 12 hours of application, sensational! Beyond a doubt this perfume is not to give \"blind\" experiment, reexperimentem and allow to it before definitely call my own.\nWord of the day: enclosed ... (day 79)\n Feb 10 2016"}, {"username": "nordhaul", "comment": "Yeah this is one of those I wore in High School\nthen forgot about.  It's one of those that I used\nup.  Why?  Because it smells GREAT.  I'm never\na fan of Giorgio Armani, nor the bottle of this Gio,\nsO I never went out and bought more... but when\nI did have it (and don't ask me how I ended up w/\nit.  I can't say I remember!), I used it again & again\nand felt OK in it for the most part.  Ah I can imagine\nthe scent now.  Warm.  Coconutty.  A bit ahead of\nits' time almost.  Today's Michael Kors anyone?  II\n Jan 14 2016"}, {"username": "mmiched", "comment": "So I purchased a bunch of perfumes at once.  I did not even know this scent was in the lot.  I got a blast of Tuberose when I sprayed which I love!  Then I get a powdery floral scent of Myrrh, sandalwood, clove, orange and a little bit of Jasmine. This scent is not for the shy girl.  It is very powerful and sultry. I sprayed over 2 hours ago and it is still very strong.  Nice sillage. I love this scent.  I would recommend night time wear.  I will not resell this one.  It is a keeper :)\n Sep 03 2015"}, {"username": "tamara.pierre", "comment": "I love LOVE love this scent!  I bought s bottle on ebay a while ago after looking for it for over a year. Sadly it's  almost gone so if anyone is overseas and has access to it or anyone in the states looking to sell one please email me [email protected]\n Jul 15 2015"}, {"username": "dalouchi", "comment": "I managed to find one and got on based on the reviews, but found out its not my style. I must admit that it is very well crafted, but l am more of a straight in your face floral (very feminine), scents..\nI am willing to swap my bottle if anyone's interested.. I am in Cairo, Egypt and can be reached at: [email protected]\n May 21 2015"}, {"username": "farhana.loonat.1", "comment": "I love it and want more of it!!\n Apr 21 2015"}, {"username": "lairderien", "comment": "How could I forget this wee beauty!  One of the joys of Fragantica is coming across reviews for lost & forgotten loves.  This was a typical early 90s powerhouse of a perfume - lots of lovely, heady tuberose.  I wish I could get my hands on a bottle - I however am reluctant to pay the ridiculous amounts some Ebay sellers are charging (shame on you).  If anyone in the UK has an unwanted bottle that they would like to swap or even decant, I will be your friend forever :-)\nUpdate: Managed to purchase a full bottle from Ebay for a fairly reasonable price.  Its just as wonderful as I remembered. Peaches and Tuberose on a woody, amber base. I get a slight spicy note also?  It IS heady though - more than one spray might offend....\n Sep 10 2014"}, {"username": "velvetrose23", "comment": "Once a upon a time I owned this perfume back in 1995....while it smelled divine in the bottle,and lovely on my skin. It was so strong that it would give me a headache. eventually I gave it way. I remember it was the tuberose,and gardenia that was very strong,and I think the cause for the headaches. It's a shame because I do like these notes in a perfume. This perfume is very beautiful.\n Sep 02 2014"}, {"username": "andjela", "comment": "Simply beautiful.<3\n Jun 05 2014"}, {"username": "beccamm", "comment": "At last I have finally found another fragrance which resembles the beautiful (discontinued) Gio - (IMO anyway)- Diptyque Do Son\n Apr 26 2014"}, {"username": "Mellyhelly", "comment": "I smelled my old sample again and again I think that this is the only Armani that had good reason to exist, together with the first one he launched.\nAfter those ones, I didn't like one single Armani anymore, at least in the mainstream channel. I never experienced the more exclusive fragrances.\n Apr 19 2014"}, {"username": "dazzlin9", "comment": "I miss this smell a lot! Strong but nice.. i have burberry london and i can smell gio in it. Does anyone smell it too in London?\n Apr 19 2014"}, {"username": "Lily2911", "comment": "Why the hell do they discontinue such  beautiful  fragrance and replace it with dull acqua di gio line ??  Bring it back Mr Armani and stop launching very generic scents!!!  And by the way bring also the original Armani for woman back, it is a shame to kill such a master piece!\n Apr 13 2014"}, {"username": "[email protected]", "comment": "Her Favourite Things is stocking up on the original at the end of March 2014. Email: [email protected]\n Mar 10 2014"}, {"username": "simee", "comment": "Gio IS NOT DISCONTINUED!!! It is still being manufactured in EUROPE and you can find it in any airport Duty-free...I bought one cellophane wrapped there and another in a cosmetic sale. Just as Joop femme is still being manufactured and is avail. in Europe.\n Feb 22 2014"}, {"username": "flowertango", "comment": "Gio, I love you! Who created you? Giorgio, himself? \nGiorgio, se e giusto ti sposo...\nI just found a bottle today and bought it. The one I used is nearly empty. I am the happiest woman of the world!!!!!!!!!\nGio, you are going to follow me a few more time.\n Feb 15 2014"}, {"username": "girlsworld", "comment": "1993 bought for me in Paris whilst wearing armani jeans ! a true 90's fragrance the jeans still exist shame this perfume has been discontinued.\n Feb 07 2014"}, {"username": "rhaineclayton", "comment": "Interesting how fragrance companies work. This is supposed to be discontinued and yet it's included in the Giorgio Armani mini set along with 4 other current fragrances. Quite cruel when you think about it - getting newcomers addicted to it then they can't get a big bottle of it!\nI also have Giorgio Beverly Hills Wings and they are very similar - Gio is perhaps slighlty creamier.\n Jan 17 2014"}, {"username": "Mortazuma", "comment": "Ah Gio, parting was such bittersweet sorrow. Why did they ever let such a beautiful fragrance fade into memory to make room for the newer and frankly, generic scents? I recall when the pair arrived at the perfumeria where I worked, this one and its counterpart, Acqua di Gio...and here is my review of Gio:\nGio, once warmed by the skin...is inviting, comforting and as dreamy as they come. The amber notes paired with creamy florals warm the subtle fruity undertones. The experience that came to mind was similar to that as a soporific embrace in a luxurious cashmere sweater while listening to Vivaldi in a garden at night, midsummer.\nIt is harmonious, elegant, romantic, soothing, yet cradles you with the warmth of flowers that are still modestly radiating heat from a cloud free afternoon. Sensually stimulating yet, unimposing. It entwines without asphixiating the person present. It is a simple and unique pleasure that shall remain fondly remembered, once upon a time.\n Dec 17 2013"}, {"username": "lollotyp", "comment": "The best Armani of the History of this brand, i give to this Masterpiece of High Quality 10/10, and a large smile of joy!\n Dec 04 2013"}, {"username": "Amarilis60", "comment": "Deep, rich, classical 'old school ' floral, very complex  and natural smelling. It's a pity they don't produce such a quality scents nowadays. Reminds me of Wings B Hills in some ways.\n Nov 06 2013"}, {"username": "supernal light", "comment": "This is the most beautiful fragrance ever. Can't believe that it's been discontinued. I love this and only have a tiny drop left...woe is me.. where can I buy some more of this gorgeous heavenly delight??\n Oct 26 2013"}, {"username": "Artemis145", "comment": "Love this gorgeous,unique fragrance. So many memories it evokes! Yet another discontinued favourite. Would just love to smell it again.\n Oct 20 2013"}, {"username": "Mellyhelly", "comment": "It was fashionable many years ago and I did like it, perhaps the only Armani's fragrance I ever liked.\nI still own a sample.\nIt's a very thick white floral with a special floral sweetness the kind you smell directly from flowers, no sugar. The white notes are perfectly completed by warm tones of wood and vanilla and the whole blend smells warm, feminine and cosy.\nIt's radiant but not subtle. Probably considered out of its time now, but it was such a treat in cold winter on a wool jumper!\n Oct 07 2013"}, {"username": "Azzrian", "comment": "I miss this scent so very much. I am so tempted to purchase on Ebay but I am worried it will be rancid. If anyone has some to sell or knows of a good place to buy please let me know. This perfume takes me back as it does many of you to my 20's. I long for this. Unfortunately it seems my second favorite scent is also being phased out. Whats with that?\n Oct 02 2013"}, {"username": "kquarles", "comment": "My favorite perfume of all time!  I would buy it in a heartbeat if I could afford to pay $250 - $300 a bottle.\n Sep 02 2013"}, {"username": "GlobalGirlyGirl", "comment": "You saved me on that overnight ferry from the Amalfi Coast to Sicily. That boat smelled dank and disgusting. The smell was overwhelming from my top bunk, and I could not sleep. A couple sprays of you helped me drift off into dreamland. I woke up refreshed to a crew man banging on the doors alerting us we were about to dock in Palermo.\nGio is complex and delicious. I lean gourmand, and Gio appealed to me. It is sweet, spicy, and subtly sexy. \nPicture a woman waking up in the strong arms of her Italian lover on crisp, white sheets. The window is open, and she notices her black cocktail dress and stilettos on the floor. She smiles as the night of passion ends and a new day begins.\n Aug 17 2013"}, {"username": "mashuda", "comment": "I would just like to thank the reviewer that said that giorgio beverly hills wings smells like this'. I ordered  my beverly hills on a blind buy just from the review and it arrived today.......maaaaaan. it transported me back to my late teenage years! Awesome. It really is the same as gio, my long lost perfume........very subtle differences but very much the same.\n Jul 31 2013"}, {"username": "boruvka44", "comment": "I recently bought a botlle of Gio (Austrian duty free shop) with a code 38H81S on the bottom. I checked cosmetic expiration calculator found on the internet and it says the bottle was manufactured in August 2011! Did they really discontinue it??\n Jun 04 2013"}, {"username": "klix27", "comment": "i purchased this in  1996 and still keep it until now (2013). Smells the same and great that i agree this perfumes smells expensive and classy. though im a male, i dont know why i like this perfume so much. Very very long lasting and sillage is huge.  i dont  find any other  perfumes come close to its sophistication. However i once got severe headache while wearing this hahaa... (sometimes it smells too overpowering and mind distracting). That never stops me from loving it either. i heard it is already discontinued, and im blessed to have it in my collection.\n Jun 03 2013"}, {"username": "[email protected]", "comment": "the best Armani perfume I wore..So beautiful!! I need to get a new one..Hope it still is around.\n Apr 21 2013"}, {"username": "Mozartiana", "comment": "This is without any doubt, my favorite perfume of all times. I whish I knew who is the master mind behind this fragrance, because this is truly something special. I remember the days when all the women I met smell either on Gio, Tresor or Vanezia. Those few years at the beginning of the nineties marked an end of an era of glorious perfumes that brought us masterpieces like Opium, Poison and Obsession. Gio is a predominantly floral perfume, however, the other notes are mixed in such a way that you can hardly smell it. The silage and longevity of Gio is monstrous you can only wash it off, and yet even a wash, the scent will still linger on your clothes. When you want to feel like you're on top of the world, put a drop on Gio and that's where it will take you.\n Mar 17 2013"}, {"username": "andjela", "comment": "one of the best ever...\n Mar 14 2013"}, {"username": "hmoncsi73", "comment": "This is my favourite fragrance. Just reminds me when I was in my early twenties in the 90s. Nothing can be compared with this beautiful, sexy and very unique blend of flavours! Simply the best! I wish we could get it at every corner. It is a shame that it has been discountinued.\n Feb 21 2013"}, {"username": "Giolove", "comment": "I've worn this perfume and nothing else ever since it came out. I've tried to find something comparable but I haven't found one that's even close to this scent. I'm not a flowery type of woman and most definitely am not a fan of the heavy cloying scents that many wore right before this came out. To me it is the perfect blend of fruity and spice. Although its been discontinued for years now I still find it on various sites but I've found that sometimes I end up with a bottle that has an undercurrent of rancid something so at the prices I'm now paying it can be quite upsetting. I have very sensitive skin and most perfumes make me itch and break out in hives. Everywhere I go I look for it and when I find it, I buy in bulk but its definitely getting harder and harder to find. The natural scent of my skin mixes beautifully with this work of perfection as the day wears on instead of getting musky like all the others I've tried. It's a very distinctive scent and I find it very sensual and it makes me feel as beautiful as a spring rain. I love it and I always will but I have smelled it on others and it doesn't become them. Their skin type turns it into a cloying overpowering, almost like old spice smell which is not appealing but for me it's perfect. I've spent so much money trying to find one to replace it and its just not out there. The scents they have now are overwhelmingly fruity or flowery and me and my skin just can't stand them. They make me sneeze or give me headaches especially in a confined space. I've got a very acute sense of smell and taste so I smell things that others don't, tastes things that others don't. I like the smell of other perfumes and have found that after about a half hour they have turned into a smell I cannot tolerate. I've worn it everyday for 20 years and love it just as much today as I did back then. It is in my eyes the perfect mixture of sweet, fruity and spicy and I find that it's like fashion. You figure out what works for you, what makes you feel beautiful and as long as you have the self assurance to know what that is well designs come and go but classics, their always in style. To GIO with love, TLC.\n Feb 14 2013"}, {"username": "marzena.michalska.44", "comment": "One of my fav. The strongest perfume i used. \nBring it back !!!!!!!!!!!!!!!!!!!!!!!!!\n Dec 05 2012"}, {"username": "cbishton", "comment": "I used to wear this in the early 90's. I remember it being a heavier cold weather evening perfume - a little mature, sophisticated and rich. I can't say that I even liked it but I remember the era well. I was young, in my mid-twenties, and was traveling a lot. I felt very sophisticated as I had just returned from living in London for a year and a half. This was one of those fragrances you own because it evokes a certain lifestyle but it didn't identify me. I preferred the green Acqua di Gio, that fragrance was fabulous - one of the best, sexiest, warm weather scents ever.\n Aug 03 2012"}, {"username": "AveParfum", "comment": "I don't know how I got so lucky as to get my hands on an enormous 1.7 oz bottle of PARFUM. I had never smelled Gio before, and I can safely say that it's exquisite. I love the seamless blending of honeyed peaches, creamy white flowers, and intense clove. The stryax/benzoin is so pleasantly pronounced.  \nI can't wear Tresor or Amarige--they are very sour to my nose. Gio is not sour, but it's also not sweet. The newly-bloomed florals lend a natural sweetness, and I detect strong tuberose and gardenia.   \nGio makes me nostalgic for the sunny warmth of Tuscany and the glorious Italian countryside. I can just imagine myself sitting in the Piazza, eating riso gelato, my absolute favorite...\n Jul 16 2012"}, {"username": "mippymuppett", "comment": "In 92 when this perfume was released I bought my first bottle.  I was 20 at the time and wore it for years.  I agree with the women who are saying that this is a very typical 90's perfume.  It is heavier but it is very beautiful!!  Sorry it has been discontinued!!  I wouldn't wear this every day but this is a nice scent to have in your collection to wear from time to time.  I think it may be too heavy for long hot summer days.  I think it is better suited for spring and fall and perfect for evenings.  I recently bought a small 5ml mini just for those moments when I feel nostalgic and want to remember my sweet 20's.  Ahhhhhhh!!!\n Jul 05 2012"}, {"username": "boruvka44", "comment": "As much as i wasn´t impressed couple years ago when i tried it the first time, as much i love it now. For untrained nose there are too strong yellow and white flowers with typical 90`s sweet heavy base. Once you like it, it`s heavenly, like a meadow in a sunny day. It evokes marsh marigold, daisies, of course gardenia and just a little bit of tuberose, cedar, vanilla and powder + a lot of sweet mellow peach. \nStrong, ultra feminine, elegant, tender\nI wonder why they discontinued such parfume. Discontinuing good old ones won`t make one buy the new stuff.\nDoes anything smell similar to Gio? (flowery sweet, warm, dry, not chemical)\nAmarige smells so cheap compared to Gio, even if they share many notes.\nedit: I find Jil Sander No. 4 similar\n Jun 07 2012"}, {"username": "mimi0377", "comment": "I have worn this perfume since I was 16 (18 years).  I absolutely adore it.  It is different than anything else I have tried.  I am down to my last 2 bottles and I don't know what I will do when I am done.  This scent is ME.  Everyone who's known me smells me and and says, \"ahhh, Jamie.\"  It is one of a kind.  It smells like a woman.\n May 04 2012"}, {"username": "elisa.fuentes briones", "comment": "it is so different from all. it lasts forever. love it\n Apr 23 2012"}, {"username": "Rose Hip", "comment": "I loved it back in the 90s. Now it brings many memories, so I could buy a bottle just as a sentimental journey.\nIt is strong, heady and beautiful. \nA smell for a brunette,perhaps?\n Apr 11 2012"}, {"username": "kathrinaaguir", "comment": "This one was my first Armani's perfume a long long time ago. I used to like it, but not anymore. It was so popular in the early 90's and I was attracted to it by its soft and warm scent.\n Sep 27 2011"}, {"username": "mymlan", "comment": "Gio EdP is such a surprise to me, and I love it. The anonymous bottle has never drawn my attention before. I guess I thought the content would be somewhat watery. However, looking at the notes I understand my adoration as I'm both a lover of white heady flowers (tuberose, gardenia) and florientals in general.\nBut what makes this fragrance so extraordinairy beautiful is the delicious fruit notes in the top. The opening smells somehow like a fruity chypre, also favourite family, but then it transforms itself to a spiced up creamy white floral. The fleating fruits sweetens it though in the most pleasant way and evens out possible sharp edges. The base is smooth and comforting.\nStrangely it reminds me of Must the Cartier in its composition. Gio's like an odd but beautiful combination of many fragrance families: fruity chypre, white floral, floriental... A strange mix that could go very wrong. But here, and in Must, the result is stunning. \nI guess I got to have Gio as well, what happend with my ambition to downsize?\n Sep 27 2011"}, {"username": "stelladoro", "comment": "It's fascinating how differently people perceive fragrance - I love Gio - and still have two bottles in safekeeping.  I wear it all the time, so spicy (from the floral notes) and floral at the same time.  Generally I prefer spicey oriental fragrances, but Gio really latched onto me.  The sillage is wonderful, it lasts at least 24 hours on me and I always receive lavish comments when I wear it.  I don't care for the current fruity floral orientals - why would anyone want to smell like food?\nMy favorite floral, I highly recommend it.\n Sep 24 2011"}, {"username": "sarazonoz", "comment": "Very 90's, very heavy and definitely not for everyone.. Personally, I have always liked it, it dries down so well on my skin after a loud and powerful start and just stays forever.. I wish there would be a Eau de Gio, a softer version of this unique beautiful scent (Aqua di Gio smells nothing like a less intense Gio). I think this would appeal to more people if it was watered down a bit. Gio is amazing for night use, and if worn by the right woman,  it can be intoxicating! In a good way!\n Aug 31 2011"}, {"username": "Klee", "comment": "Loud! It's really a 80s fragrance but I love it.  Have been wearing it lately, even though it's Summer.  My office is air conditioned.  It's been discontinued so you have to pay almost $150 for it. It's worth though!\n Aug 10 2011"}, {"username": "OlfractalInfemme", "comment": "A peachy spicy chypre. Very rich, opulent. Heavy on the tuberose. Intoxicating. Stays close to the skin, which is nice for such a rich fragrance.\n Aug 05 2011"}, {"username": "onimoka", "comment": "it has deep and creamy base. Romantic, not heavy, very aromatic and good balanced fragrance. Cannot understand why it is discontinued. For those who do not know this fragranse i will recomend to get a sample first. It is very rare and rather expencive. But if your body chemistry will allow, you will not regred. P.S In case you got it blind and not like it- do not \"swap\" it too fast :) Demand all you can get in return LOL\n Aug 04 2011"}, {"username": "20thcenturyrelic", "comment": "I bought a tube of the body lotion several years ago and got many compliments when I used it. Maybe I should buy some of the fragrance.  I liked it at the time, but not enough to buy more.\n Aug 02 2011"}, {"username": "Radchick", "comment": "This is for tuberose and gardenia lovers. A very bold floral, not for the faint of heart.\n Jul 19 2011"}, {"username": "jemma", "comment": "I arrived Gio Armani! After yesterday's post for him, not knowing what to expect ... but once sprayed, the first thing that came to my mind was AMARIGE? I went and spray Amarizh of others. hand, to similar, like sisters, beautiful, thick, soft! Gio likes me, I have it too! For one more time how convinced are misleading and subjective our perceptions Smile your day!\n Jun 29 2011"}, {"username": "kraxa", "comment": "I just got myself a bottle of this, found it on an flea and art market stalls in Delft, Holland. That must be my holiday treasure this year ;-) Unfortunately I can't judge if the juice has aged well, as this is my first ever encounter with Gio. But never mind, I am still  enjoying simply being in possesion of such a rare gem.\n Jun 11 2011"}, {"username": "cisco", "comment": "I agree and disagree with many here.  This is an amazing fragrance that requires so little to bloom into beauty it is actually cost effective.  It has a life span that puts most scents to shame.  \nI do not agree that it is related to Eternity.  That nasty overwhelming clove scent in Eternity does not hit me with Gio.  The clove note is odd because neither Eternity nor Gio contain cloves.  With Eternity, I could not get past the clove note.  I finally quit wearing Eternity because of that. \nGio is a huge mysterious bunch of spicy flowers!!!   It has a deep creamy base unlike many florals and is full of resin. It does not bring to mind an English garden.  It is far from clean, clear, and crisp.  It is dark, delicious, and dense.   \nIf possible, get a sample of Gio before you purchase. It is a fragrance that does not work for everyone and is far too expensive to waste. To me, it is a jewel that smells like nothing else. I carefully treasure what remains of my Gio.\n Jun 07 2011"}, {"username": "Galya", "comment": "If you want to find a substitute of this fragrance I can say that Montal gold flowers is identical!\n Jun 03 2011"}, {"username": "nora elia", "comment": "I tried this perfume when I was 18 or 19 at that time it was kind heavy for my age however I did not have other choices. Now I am on my thirties and I think it is perfect for my age but it is difficult to find and it did not smell the same :( \nIt smells elegant sophisticated orangy . It brings me nice memories\n Jun 02 2011"}, {"username": "Doc Elly", "comment": "At first I smell fruity jello, several flavors all mixed together, and violets. Then there’s the onslaught of mixed florals, probably containing lily-of-the-valley and miscellaneous white florals, including a pinch of tuberose. There’s also some dried apricot. And there’s ylang-ylang. \nGio is similar to the big 80s floral powerhouse scents, but as one created at the tail end of that trend, it is nudging over into fruity-floral territory. I dabbed carefully, expecting it to be strong, and this turned out to be the right decision. After a few fruit-containing hours it turns into a floral scent that’s mostly jasmine with a hint of something sweet and plastic-like. In the end, it dries down to a sweet musk that is quite persistent. There’s considerable sillage, and the scent lasts at least 10-12 hours. Gio is a pleasant, fruity-floral musk that isn’t particularly novel, but is certainly an enjoyable fragrance to wear.\n Apr 19 2011"}, {"username": "LydiaLiu", "comment": "Gio has a distinctive feature of 80s, 90s. It's a classic flower bouquet, dark, thick, intense, powdery and to my nose something herbal. I don’t think I have much say in the 80s 90s perfumes, but in my opinion If you like Shalimar or Opium, very possible you like Gio.\n Mar 26 2011"}, {"username": "LaPetite", "comment": "I'm sorry for those who love it, but to me it's one of the worse scent ! It's truly a horror !It smells like some toilet cleaner thing . If there was a \"Hate\" button here, i would have clicked ! I can't believe it has been produced for so many years whereas many other perfumes were discontinued and didn't deserve to.\nUnfortunately there's a woman who lives in the same building as i do , and she wears it , and when i walk just behind her in the elevator, i know she's been there >< !\nDon't be mad at me \"Gio\" lovers, this is just me taste ;-)\n Jan 23 2011"}, {"username": "sofiii", "comment": "Gio is a nice surprise if you like the 80s and 90s golden perfumes like Paris by YSL, White Dimond by Elizabeth Taylor.\nGio starts with a burst of quasi-aquatic white flower with a tiny hint of fruitiness which I can’t really put my fingers through. Soon after that, I can smell a beautiful white flower bouquet, and tuberose is quite dominant in it. As the perfume being warmed up, it turns more and more towards the 80s bold aldhyde direction in a nice way. It is big, loud, bold and really well-blended, the only notes I can detect occassionly is ylang ylang and tuberose; the blend somehow smell really clean and has a trasluscent watery quality but not in the clean aquatic after 2000 sports perfumes way. The kinda cleaness reminds me of J.Lo Love at First Glow, but Gio is less synthetic-smelling.\nThe dry down is tart, syrup sweet, with a subtal peachy hint, it’s like a slightly inperfect version of Annick Goutal’s Passion.\nGio can be a nice gift for anyone likes bold 80s/90s floral perfumes (I can hardly detect any typical fruity notes in Gio). However, to be able to pull it off easily, I guess you’d better not to wear Gio to uni or you’d better to have the glamourous little-black-dress kinda look when wearing it.\nAlso, apply with a light hand, for me one drop from the miniature goes a long way, while I normally spray 2 sprays of most post 2000 floral fruity perfumes.\n Dec 17 2010"}, {"username": "imoore", "comment": "Pastel de Gres can manage the same sillage for much less money with better longevity in my opinion!\nMostly it contains peaches...\n Jul 01 2010"}, {"username": "Manya", "comment": "My first impression was - blinding gold, like midday hot sun reflected on a calm sea. \nAn intoxicating bouquet that settled on my wrist with syrupy, honey notes. This fragrance is extremely seductive, the kind that won't take no for an answer :) I absolutely must get a bottle ASAP!\n Apr 21 2010"}, {"username": "Sarah Bas Eleazar", "comment": "Simply the best perfume in the world of all time!\nStrong, stylish too. All perceive its scent, its power!\nAmazing, delicious, the smell of cloves is predominate but the scent of flowers is also very striking.\nA happy and perfect blend of flavors unmatched.\nEverything you could want and wait for the perfect scent!\nNo perfume can touch it. The best!\nPowerful!\n Apr 06 2010"}, {"username": "sherapop", "comment": "Giorgio Armani GIO is a big billowy bouquet of flowers, a few of the white petals of which have been studded with cloves. All of this is anchored in a substantial base which somehow magnifies the florals over time. Apply a tiny bit, and it will expand over the course of a few hours to take over whatever space you currently happen to inhabit. \nGIO is very similar in brash spirit, monster sillage, and eternal longevity to Calvin Klein ETERNITY, and equally a part of the late 80's trend to excess. Just look at the list of notes! Everything but the kitchen sink was thrown into GIO. The composition somehow still works, but only if *very* sparingly applied. These fragrances are so potent that they can only be washed away--no need for a purse spray!\nMy own intolerance of the clove note explains why my bottle is still 3/4 full, though it was purchased years ago, but I do believe that this is a worthy creation, and can recommend it to anyone who likes ETERNITY. (Hmmm... it appears that my recommendation may be otiose, since GIO appears to have gone out of production some time ago--no doubt because ETERNITY won out. And I suppose it's true: No one really needs to own both GIO and ETERNITY.) \nThe elegant bottle is the same as that used for ACQUA DI GIO, with a thin, almost chiplike shape. The ACQUA version is frosted, while the GIO bottle is clear.\n Mar 21 2010"}, {"username": "frenkuzumu", "comment": "All Gio Lovers, you can still find Gio!This perfume fits well all woman who would like feel sexy with one drop!\"Here it comes, the beautiful ones\" just like the song says.\nActually I do not like vanilla notes at all since it causes headaches to me but I would like say that Gio is exception.\n Jan 26 2010"}, {"username": "allexa27", "comment": "All i can smell are tuberose and carnations.I really dont like it.It reminds me liiiil bit of Temptations byPaloma P\n Sep 23 2009"}, {"username": "turkishrose", "comment": "it has very nice notes..\n Jul 08 2009"}, {"username": "veruska", "comment": "I've never found an armani perfume that i actually loved. but this one is at least very likable and it reminds me of the start of a decade that everything was possible. it 's fairly popular in here and it's not hard to see why. Heady  intense floral with honey, a tiny spring coolness, and some resinous undertones and at least on my skin nothing aquatic. it's quite distinctive and as it goes on it becomes sweeter with a full bloomed orange blossom scent. The drydown is warm and balsamic with  a nice comforting woody vanilla on your skin. Although it's nothing unusual i find it good in a simple fun way\n Dec 09 2008"}, {"username": "golden", "comment": "I smelt this on a beautiful looking women, who at the time looked so stylish (back in the 90's) It was very different at that time compared to alot of perfumes from that era (armerage,opium)\nIt was so beautiful i went to try it on and yes right enough smelt good on me too, which when i wore it like the lady i saw it made made me feel beautiful.\n Oct 17 2008"}, {"username": "sonrise", "comment": "I bought this particular scent several times I got many compliments on it. It is very strong.  There is a very sweet quality to it.\n Sep 29 2008"}, {"username": "chance25", "comment": "I remember having a tiny little bottle of this in the mid nineties. Although I thought it was strong, it still seemed to catch my attention. If it were still being made I'd probably wear it now.\n Aug 13 2008"}, {"username": "takemyhusbandplz", "comment": "Gio started out good  but quickly, turns into a rancid, very chemical fragrance upon dry down- I had to scrub it off. YUCK!\n Jan 22 2008"}], "Usernames": ["massimilianoinquieto", "lanolin", "SF2", "SuzanneS", "sibaraa", "Iris-Siberica", "renzi79", "Contessa01", "chloeh", "chloeh", "Snowminx", "lmwimsatt", "df21", "Alvie Kuptz", "CaroleWard1812", "irawidatami", "Orient74", "Mesquite-Bean", "Vegas Pauli", "twylaleblanc", "juliana chika", "socorrosouza", "Ohkit", "ramskates", "la fleur dorée", "Jernê Knowles", "nordhaul", "mmiched", "tamara.pierre", "dalouchi", "farhana.loonat.1", "lairderien", "velvetrose23", "andjela", "beccamm", "Mellyhelly", "dazzlin9", "Lily2911", "[email protected]", "simee", "flowertango", "girlsworld", "rhaineclayton", "Mortazuma", "lollotyp", "Amarilis60", "supernal light", "Artemis145", "Mellyhelly", "Azzrian", "kquarles", "GlobalGirlyGirl", "mashuda", "boruvka44", "klix27", "[email protected]", "Mozartiana", "andjela", "hmoncsi73", "Giolove", "marzena.michalska.44", "cbishton", "AveParfum", "mippymuppett", "boruvka44", "mimi0377", "elisa.fuentes briones", "Rose Hip", "kathrinaaguir", "mymlan", "stelladoro", "sarazonoz", "Klee", "OlfractalInfemme", "onimoka", "20thcenturyrelic", "Radchick", "jemma", "kraxa", "cisco", "Galya", "nora elia", "Doc Elly", "LydiaLiu", "LaPetite", "sofiii", "imoore", "Manya", "Sarah Bas Eleazar", "sherapop", "frenkuzumu", "allexa27", "turkishrose", "veruska", "golden", "sonrise", "chance25", "takemyhusbandplz"]}}, {"name": "Acqua di Gio", "uri": "https://www.fragrantica.com/perfume/Giorgio-Armani/Acqua-di-Gio-410.html", "img": "https://fimgs.net/mdimg/perfume/m.410.jpg", "id": "410", "year": "1996", "gender": "for men", "profile": {"list_of_mainAccords": ["citrus", "aromatic", "marine", "fresh spicy", "floral", "green"], "mainpicture": "https://fimgs.net/mdimg/perfume/375x500.410.jpg", "Longevity": ["poor", "88", "weak", "232", "moderate", "998", "long lasting", "296", "very long lasting", "86"], "Sillage": ["soft", "275", "moderate", "1125", "heavy", "220", "enormous", "93"], "Reviews": [{"username": "gorjan78", "comment": "Posibly best and most versatile fragnance ever.\nYou can wear it in summer, winter, day, night, hot or cold, office, beach, club, house porch...\nYou can weat it if you young, middle ages or old..\nAqua is so versatile...\nOnly dropdown is that is not so lasting and that is sold too much\n Jul 22 2019"}, {"username": "Bfreepro417", "comment": "One of the best scents ever created, this is THE citrus frag with tons of class and personality. It’s ridiculously refreshing and unique. It’s spicy, comforting, fresh, and supremely uplifting, expertly blending various notes to create an unforgettable masterpiece. It’s common as hell but who cares, there’s a reason, it’s a modern classic. I stopped wearing it for years because people will tell you “oh it’s so common, it’s so played out,” but I regret ever listening to that nonsense and not wearing this. It’s absolutely amazing and one of the most unique and uplifting scents I’ve ever worn. Lasts a long time, perfect for casual day wear, work, evenings out, any day, any event, any season. If I had to own just one fragrance for the rest of my life, I would STRONGLY consider choosing this one. Timeless. \n10/10, the best citrus/fresh fragrance ever created.\n Jul 19 2019"}, {"username": "Noggie", "comment": 